# Parameter Type Id Move Constrain Property

Source: https://www.revitapidocs.com/2026/d50b0d26-c418-3e51-de33-c949dadcbcff.htm

---

| Parameter Type Id Move Constrain Property |
| --- |

"Constrain"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MoveConstrain { get; }
```

```
Public Shared ReadOnly Property MoveConstrain As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MoveConstrain {
	ForgeTypeId^ get ();
}
```

```
static member MoveConstrain : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace